/*****************************************************************************
  * 文件名称: data_flash.c
  * 作    者: 尤伟宏
  * 编写日期: 五月 2019
  * 功    能: 
  ****************************************************************************
  * 说    明:
  * 
  *****************************************************************************/
	
/* 包含头文件 ----------------------------------------------------------------*/
#include "data_flash.h"
/* 私有类型定义 --------------------------------------------------------------*/
data_flash_info_struct test_struct;
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
uint32_t writeFlashData = 0x55555555;
uint32_t addr = 0x08007000;
/* 扩展变量 ------------------------------------------------------------------*/
/* 私有函数原形 --------------------------------------------------------------*/
/* 函数体 --------------------------------------------------------------------*/
/*************************************
  * 函数功能: Flash写数据
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  ************************************/
void WriteDataFlash(uint8_t* buff, uint32_t Len)
{
  __disable_irq();
    //1、解锁FLASH
  HAL_FLASH_Unlock();

    //2、擦除FLASH
    //初始化FLASH_EraseInitTypeDef
    FLASH_EraseInitTypeDef f;
    f.TypeErase = FLASH_TYPEERASE_SECTORS;
    f.Sector = FLASH_SECTOR_11;
    f.NbSectors = 1;
    //设置PageError
    uint32_t PageError = 0;
    //调用擦除函数
    HAL_FLASHEx_Erase(&f, &PageError);

    
    for(unsigned int i=0;i<Len;i++)
    {
      // 对FLASH烧写
      HAL_FLASH_Program(TYPEPROGRAM_BYTE, 0x080E0000+i, buff[i]);
    }

    //4、锁住FLASH
  HAL_FLASH_Lock();
  __enable_irq();
}

/*************************************
  * 函数功能: Flash读数据
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  ************************************/
void ReadDataFlash(uint8_t* buff, uint32_t dest_addr, uint32_t Len)
{
  uint32_t i;

  for(i = 0; i < Len; i++)
  {
    buff[i] = *(__IO uint8_t*)(dest_addr + i);
  }
}

/************************************************ 文件结束 ************************************************/
