/*****************************************************************************
  * 文件名称: Stepper.c
  * 作    者: 尤伟宏
  * 编写日期: 一月 2019
  * 功    能: 步进电机控制
  ****************************************************************************
  * 说    明:
  * 
  *****************************************************************************/
	
/* 包含头文件 ----------------------------------------------------------------*/
#include "Stepper.h"
/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
/* 私有函数原形 --------------------------------------------------------------*/
/* 函数体 --------------------------------------------------------------------*/
/*************************************
  * 函数功能: 步进电机初始化
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 步进电机使能
  ************************************/
void Stepper_Init(void)
{
  HAL_GPIO_WritePin(Stepper_EN_GPIO_Port, Stepper_EN_Pin, GPIO_PIN_SET);  //步进电机暂不使能
  HAL_TIM_PWM_Stop(&htim10,TIM_CHANNEL_1);  //脉冲停止
}

/*************************************
  * 函数功能: 步进电机启动
  * 输入参数: uint8_t stepper_number, uint8_t dir
  * 返 回 值: 无
  * 说    明: 无
  ************************************/
void Stepper_Start(uint8_t dir)
{
  if(dir == Up)
  {
    HAL_GPIO_WritePin(Stepper_DIR_GPIO_Port, Stepper_DIR_Pin, GPIO_PIN_SET);  //步进电机1前进
  }
  else /* if(dir == Down) */
  {
    HAL_GPIO_WritePin(Stepper_DIR_GPIO_Port, Stepper_DIR_Pin, GPIO_PIN_RESET);  //步进电机1后退
  }
  HAL_GPIO_WritePin(Stepper_EN_GPIO_Port, Stepper_EN_Pin, GPIO_PIN_RESET);  //步进电机使能
  HAL_TIM_PWM_Start(&htim10,TIM_CHANNEL_1);  //脉冲产生
}

/*************************************
  * 函数功能: 步进电机停止
  * 输入参数: uint8_t stepper_number
  * 返 回 值: 无
  * 说    明: 无
  ************************************/
void Stepper_Stop(void)
{
  HAL_GPIO_WritePin(Stepper_EN_GPIO_Port, Stepper_EN_Pin, GPIO_PIN_SET);  //步进电机失能
  HAL_TIM_PWM_Stop(&htim10,TIM_CHANNEL_1);  //脉冲停止
}

/************************************************ 文件结束 ************************************************/
