/*****************************************************************************
  * 文件名称: DC_Motor.c
  * 作    者: 尤伟宏
  * 编写日期: 一月 2019
  * 功    能: 直流电机相关
  ****************************************************************************
  * 说    明:
  * 
  *****************************************************************************/
	
/* 包含头文件 ----------------------------------------------------------------*/
#include "DC_Motor.h"
/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
/* 左右电机PWM高电平时长 */
__IO int16_t PWM_Duty[2] = {STOP_PWM, STOP_PWM};   
/* 各个电机PWM占空比：PWM_Duty/L298N_TIM_PERIOD*100%
	 占空比为：50%时电机不转
	 占空比不为：50%时电机旋转，与50%的绝对差越大旋转速度也高 */
/* 私有函数原形 --------------------------------------------------------------*/
/* 函数体 --------------------------------------------------------------------*/
/**
  * 函数功能: L298N直流电机控制
  * 输入参数: number：电机编号，支持三个电机驱动
  *             参数：1：对应高级定时器通道1和互补通道1
  *                   2：停机
  *           PWM：电机速度和方向调节
  *             参数：0 - 999 ：数值与499差值越大，速度越快
  * 返 回 值: 无
  * 说    明：无
  */
void DCMotor_Contrl(uint8_t motor_number, uint16_t PWM)
{
  switch(motor_number)
	{
		case Motor_Left:
	    HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_1);
      HAL_TIMEx_PWMN_Start(&htim1, TIM_CHANNEL_1);
      __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, PWM);   
		case Motor_Right:
	    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
      HAL_TIMEx_PWMN_Start(&htim1, TIM_CHANNEL_2);
      __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, PWM);   
	}
}

/************************************************ 文件结束 ************************************************/
